// УРОК 24

// Строгий режим
"use strict";

// Домашнє завдання

// ! Задача №1
/*
  ++ - інкремент, тобто збільшення числа на 1;
  let someVar = 0;
  ++someVar; Отримаємо одиницю(0+1)

  if (someVar){
    console.log(someVar) Отримаємо 1, проте значення вважається за true, оскільки оператор if перетворює змінні(значення змінних) в тип boolean;
  }
*/

// ! Задача №2
/*
for (let index = 1; index < 11; index++) {
  console.log(`Пункт №${[index]}`);
    Починаємо з 1, тоді вказуємо на 1 більше в умові. Для виведення результату прописуємо текст і масив, який містить змінну index що збільшується на 1 до певної умови.
}
*/
// ! Задача №3

/*
  Що потрапить в консоль ?
  if (2 * 20 <= 10 || 30 / 2 < 5 && 10 <= "10" || 20 === "20") {
    console.log('000');
  }

  Розв'язок

  if (false || false && true || false){
  }
  40 не є менше чи дорівнює за 10.
  15 не менше за 5.
  10 менше дорівнює 10.
  20 не дорівнює рядку(=== - оператор не змінює тип)
  if (false || false || false){
  } - Пріорітет у оператора &&
  if(false){
  }
*/

// ! Задача №4
/*
function someFunc(a, b) {
  Перевірка чи є наші числа є типом NaN або b = 0( на нуль ділити не можна )
  if (isNaN(a) || isNaN(b) || b == 0) {
    return `Невірні вхідні дані. Будь ласка, введіть числа та уникніть ділення на 0.`;
  }
  Створюємо змінну з обчисленням
  const result = a / b;
  Перевіряємо чи є результат скінченним числом(а не NaN, Infinity etc.)
  if (!isFinite(result)) {
    return `Результат ділення не є числом. Будь ласка, введіть інші значення.`;
  }

  return `Результат ділення ` + result;
}

console.log(someFunc(10, 5));

console.log(someFunc(4, 5));

console.log(someFunc(1, 5));

console.log(someFunc(90, 5));

console.log(someFunc());
*/

// ! Задача №5
/*
let array = [1, `Name`, 4, 5, 10];
Метод перебору - це використання методу forEach
array.forEach((arrayElement) => {
  Перевіряємо змінну чи arrayElement на наявність числа 10
  if (arrayElement === 10) {
    Якщо число є, показуємо у консолі резульат
    console.log(`Тут є ${arrayElement};`);
  }
});
*/